spec/cassettes/Shipping_address_in_checkout_flow/when_there_is_no_pre-existing_shipping_address/completes_checkout_process.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: UTF-8
      string: email=vilma%40kesslerweissnat.ca&card[number]=4111111111111111&card[exp_month]=12&card[exp_year]=2019&card[cvc]=123&card[name]=Spree+Commerce&card[address_line1]=10+Lovely+Street&card[address_line2]=Northwest&card[address_country]=NAME_33&card[address_zip]=35005&card[address_state]=STATE_NAME_45&card[address_city]=Herndon
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Authorization:
      - Basic c2tfdGVzdF9WQ1puRHYzR0xVMTVUUnZuOGkyRXNhQU46
      User-Agent:
      - Stripe/v1 ActiveMerchantBindings/1.78.0
      Stripe-Version:
      - '2015-04-07'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.78.0","lang":"ruby","lang_version":"2.5.0 p0 (2017-12-25)","platform":"x86_64-darwin17","publisher":"active_merchant"}'
      X-Stripe-Client-User-Metadata:
      - '{"ip":null}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 23 May 2018 22:39:53 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1495'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_EOmMOrtZB1GGSv
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_CuvTbMqC6z8ob7",
          "object": "customer",
          "account_balance": 0,
          "created": 1527115193,
          "currency": null,
          "default_source": "card_1CV5cb22AWtpwVQmx6ZMg1HP",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "vilma@kesslerweissnat.ca",
          "invoice_prefix": "2A37AF2",
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_1CV5cb22AWtpwVQmx6ZMg1HP",
                "object": "card",
                "address_city": "Herndon",
                "address_country": "NAME_33",
                "address_line1": "10 Lovely Street",
                "address_line1_check": "pass",
                "address_line2": "Northwest",
                "address_state": "STATE_NAME_45",
                "address_zip": "35005",
                "address_zip_check": "pass",
                "brand": "Visa",
                "country": "US",
                "customer": "cus_CuvTbMqC6z8ob7",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 12,
                "exp_year": 2019,
                "fingerprint": "nMGtzMc0CKPKDH0u",
                "funding": "unknown",
                "last4": "1111",
                "metadata": {},
                "name": "Spree Commerce",
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_CuvTbMqC6z8ob7/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_CuvTbMqC6z8ob7/subscriptions"
          }
        }
    http_version: 
  recorded_at: Wed, 23 May 2018 22:39:53 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_CuvTbMqC6z8ob7/cards/card_1CV5cb22AWtpwVQmx6ZMg1HP
    body:
      encoding: UTF-8
      string: exp_month=12&exp_year=2019&name=Spree+Commerce&address_city=Herndon&address_country=US&address_state=STATE_ABBR_45&address_line1=10+Lovely+Street&address_line2=Northwest&address_zip=35005
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Authorization:
      - Basic c2tfdGVzdF9WQ1puRHYzR0xVMTVUUnZuOGkyRXNhQU46
      User-Agent:
      - Stripe/v1 ActiveMerchantBindings/1.78.0
      Stripe-Version:
      - '2015-04-07'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.78.0","lang":"ruby","lang_version":"2.5.0 p0 (2017-12-25)","platform":"x86_64-darwin17","publisher":"active_merchant"}'
      X-Stripe-Client-User-Metadata:
      - '{"ip":null}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 23 May 2018 22:39:58 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '635'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_2lSNZdbh1qmLZl
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "card_1CV5cb22AWtpwVQmx6ZMg1HP",
          "object": "card",
          "address_city": "Herndon",
          "address_country": "US",
          "address_line1": "10 Lovely Street",
          "address_line1_check": "pass",
          "address_line2": "Northwest",
          "address_state": "STATE_ABBR_45",
          "address_zip": "35005",
          "address_zip_check": "pass",
          "brand": "Visa",
          "country": "US",
          "customer": "cus_CuvTbMqC6z8ob7",
          "cvc_check": "pass",
          "dynamic_last4": null,
          "exp_month": 12,
          "exp_year": 2019,
          "fingerprint": "nMGtzMc0CKPKDH0u",
          "funding": "unknown",
          "last4": "1111",
          "metadata": {},
          "name": "Spree Commerce",
          "tokenization_method": null
        }
    http_version: 
  recorded_at: Wed, 23 May 2018 22:39:58 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_CuvTbMqC6z8ob7/cards/card_1CV5cb22AWtpwVQmx6ZMg1HP
    body:
      encoding: UTF-8
      string: exp_month=12&exp_year=2019&name=Spree+Commerce&address_city=Herndon&address_country=US&address_state=STATE_ABBR_45&address_line1=10+Lovely+Street&address_line2=Northwest&address_zip=35005
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Authorization:
      - Basic c2tfdGVzdF9WQ1puRHYzR0xVMTVUUnZuOGkyRXNhQU46
      User-Agent:
      - Stripe/v1 ActiveMerchantBindings/1.78.0
      Stripe-Version:
      - '2015-04-07'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.78.0","lang":"ruby","lang_version":"2.5.0 p0 (2017-12-25)","platform":"x86_64-darwin17","publisher":"active_merchant"}'
      X-Stripe-Client-User-Metadata:
      - '{"ip":null}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 23 May 2018 22:40:00 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '635'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_0QyKqR7XCcO7ON
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "card_1CV5cb22AWtpwVQmx6ZMg1HP",
          "object": "card",
          "address_city": "Herndon",
          "address_country": "US",
          "address_line1": "10 Lovely Street",
          "address_line1_check": "pass",
          "address_line2": "Northwest",
          "address_state": "STATE_ABBR_45",
          "address_zip": "35005",
          "address_zip_check": "pass",
          "brand": "Visa",
          "country": "US",
          "customer": "cus_CuvTbMqC6z8ob7",
          "cvc_check": "pass",
          "dynamic_last4": null,
          "exp_month": 12,
          "exp_year": 2019,
          "fingerprint": "nMGtzMc0CKPKDH0u",
          "funding": "unknown",
          "last4": "1111",
          "metadata": {},
          "name": "Spree Commerce",
          "tokenization_method": null
        }
    http_version: 
  recorded_at: Wed, 23 May 2018 22:40:00 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: UTF-8
      string: card=card_1CV5cb22AWtpwVQmx6ZMg1HP&amount=1999&currency=usd&description=Spree+Order+ID%3A+R454525646-PLM32O7X&payment_user_agent=Stripe%2Fv1+ActiveMerchantBindings%2F1.78.0&customer=cus_CuvTbMqC6z8ob7&capture=false
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Authorization:
      - Basic c2tfdGVzdF9WQ1puRHYzR0xVMTVUUnZuOGkyRXNhQU46
      User-Agent:
      - Stripe/v1 ActiveMerchantBindings/1.78.0
      Stripe-Version:
      - '2015-04-07'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.78.0","lang":"ruby","lang_version":"2.5.0 p0 (2017-12-25)","platform":"x86_64-darwin17","publisher":"active_merchant"}'
      X-Stripe-Client-User-Metadata:
      - '{"ip":null}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 23 May 2018 22:40:02 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1838'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_5ncDFcubgaCiaA
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_1CV5cj22AWtpwVQm82LHQ80S",
          "object": "charge",
          "amount": 1999,
          "amount_refunded": 0,
          "application": null,
          "application_fee": null,
          "balance_transaction": null,
          "captured": false,
          "created": 1527115201,
          "currency": "usd",
          "customer": "cus_CuvTbMqC6z8ob7",
          "description": "Spree Order ID: R454525646-PLM32O7X",
          "destination": null,
          "dispute": null,
          "failure_code": null,
          "failure_message": null,
          "fraud_details": {},
          "invoice": null,
          "livemode": false,
          "metadata": {},
          "on_behalf_of": null,
          "order": null,
          "outcome": {
            "network_status": "approved_by_network",
            "reason": null,
            "risk_level": "normal",
            "seller_message": "Payment complete.",
            "type": "authorized"
          },
          "paid": true,
          "receipt_email": null,
          "receipt_number": null,
          "refunded": false,
          "refunds": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/charges/ch_1CV5cj22AWtpwVQm82LHQ80S/refunds"
          },
          "review": null,
          "shipping": null,
          "source": {
            "id": "card_1CV5cb22AWtpwVQmx6ZMg1HP",
            "object": "card",
            "address_city": "Herndon",
            "address_country": "US",
            "address_line1": "10 Lovely Street",
            "address_line1_check": "pass",
            "address_line2": "Northwest",
            "address_state": "STATE_ABBR_45",
            "address_zip": "35005",
            "address_zip_check": "pass",
            "brand": "Visa",
            "country": "US",
            "customer": "cus_CuvTbMqC6z8ob7",
            "cvc_check": "pass",
            "dynamic_last4": null,
            "exp_month": 12,
            "exp_year": 2019,
            "fingerprint": "nMGtzMc0CKPKDH0u",
            "funding": "unknown",
            "last4": "1111",
            "metadata": {},
            "name": "Spree Commerce",
            "tokenization_method": null
          },
          "source_transfer": null,
          "statement_descriptor": null,
          "status": "succeeded",
          "transfer_group": null
        }
    http_version: 
  recorded_at: Wed, 23 May 2018 22:40:02 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_CuvTbMqC6z8ob7/cards/card_1CV5cb22AWtpwVQmx6ZMg1HP
    body:
      encoding: UTF-8
      string: exp_month=12&exp_year=2019&name=Spree+Commerce&address_city=Herndon&address_country=US&address_state=STATE_ABBR_45&address_line1=10+Lovely+Street&address_line2=Northwest&address_zip=35005
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Authorization:
      - Basic c2tfdGVzdF9WQ1puRHYzR0xVMTVUUnZuOGkyRXNhQU46
      User-Agent:
      - Stripe/v1 ActiveMerchantBindings/1.78.0
      Stripe-Version:
      - '2015-04-07'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.78.0","lang":"ruby","lang_version":"2.5.0 p0 (2017-12-25)","platform":"x86_64-darwin17","publisher":"active_merchant"}'
      X-Stripe-Client-User-Metadata:
      - '{"ip":null}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 23 May 2018 22:40:03 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '635'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_nNGUktBPDJTM2W
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "card_1CV5cb22AWtpwVQmx6ZMg1HP",
          "object": "card",
          "address_city": "Herndon",
          "address_country": "US",
          "address_line1": "10 Lovely Street",
          "address_line1_check": "pass",
          "address_line2": "Northwest",
          "address_state": "STATE_ABBR_45",
          "address_zip": "35005",
          "address_zip_check": "pass",
          "brand": "Visa",
          "country": "US",
          "customer": "cus_CuvTbMqC6z8ob7",
          "cvc_check": "pass",
          "dynamic_last4": null,
          "exp_month": 12,
          "exp_year": 2019,
          "fingerprint": "nMGtzMc0CKPKDH0u",
          "funding": "unknown",
          "last4": "1111",
          "metadata": {},
          "name": "Spree Commerce",
          "tokenization_method": null
        }
    http_version: 
  recorded_at: Wed, 23 May 2018 22:40:03 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_CuvTbMqC6z8ob7/cards/card_1CV5cb22AWtpwVQmx6ZMg1HP
    body:
      encoding: UTF-8
      string: exp_month=12&exp_year=2019&name=Spree+Commerce&address_city=Herndon&address_country=US&address_state=STATE_ABBR_45&address_line1=10+Lovely+Street&address_line2=Northwest&address_zip=35005
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Authorization:
      - Basic c2tfdGVzdF9WQ1puRHYzR0xVMTVUUnZuOGkyRXNhQU46
      User-Agent:
      - Stripe/v1 ActiveMerchantBindings/1.78.0
      Stripe-Version:
      - '2015-04-07'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.78.0","lang":"ruby","lang_version":"2.5.0 p0 (2017-12-25)","platform":"x86_64-darwin17","publisher":"active_merchant"}'
      X-Stripe-Client-User-Metadata:
      - '{"ip":null}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 23 May 2018 22:40:05 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '635'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_poaovN0PLBqcCx
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "card_1CV5cb22AWtpwVQmx6ZMg1HP",
          "object": "card",
          "address_city": "Herndon",
          "address_country": "US",
          "address_line1": "10 Lovely Street",
          "address_line1_check": "pass",
          "address_line2": "Northwest",
          "address_state": "STATE_ABBR_45",
          "address_zip": "35005",
          "address_zip_check": "pass",
          "brand": "Visa",
          "country": "US",
          "customer": "cus_CuvTbMqC6z8ob7",
          "cvc_check": "pass",
          "dynamic_last4": null,
          "exp_month": 12,
          "exp_year": 2019,
          "fingerprint": "nMGtzMc0CKPKDH0u",
          "funding": "unknown",
          "last4": "1111",
          "metadata": {},
          "name": "Spree Commerce",
          "tokenization_method": null
        }
    http_version: 
  recorded_at: Wed, 23 May 2018 22:40:05 GMT
recorded_with: VCR 4.0.0
